// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "Sincronização de Ficheiros";

// Text of "ok" button, used in various dialogs.
"OK" = "OK";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "Cancelar";

// Text of "Next" button, used in various dialogs
"NEXT" = "Seguinte";

// Text of "Done" button, used in various dialogs
"DONE" = "Terminado";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "Continuar";


// ------------------------
// Exception (error) window

"DESTINATION:" = "Destino:";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "Alteração:";		// Modified label - prefixes the displayed mod date
"NAME:"        = "Nome:";			// Name label - prefixes the name of the file
"SIZE:"        = "Tamanho:";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "Neste computador";	// For iDisk
".MAC"          = "Em %@";				// For iDisk
"LOCAL_MHD"     = "Neste computador";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "Na rede";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "Mostrar no Finder";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "Erro do iDisk";
"MHD ERROR TITLE"   = "Erro de sincronização da pasta pessoal";
"FS ERROR TITLE"    = "Erro de sincronização do ficheiro";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "O código de erro é %d.";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "Erro do iDisk %d de %d";
"MHD ERROR COUNT%"   = "Erro de sincronização da pasta pessoal %d de %d";
"FS ERROR COUNT%"    = "Erro de sincronização do ficheiro %d de %d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "Ocorreu um problema ao apagar o ficheiro “%@”.";
"ERROR SYNCING%"       = "Ocorreu um problema ao sincronizar o ficheiro “%@”.";
"ERROR MOVING%"        = "Ocorreu um problema ao deslocar o ficheiro “%@”.";
"ERROR ACCESSING%"     = "Ocorreu um problema ao sincronizar o ficheiro “%@”.";
"DIR:ERROR DELETING%"  = "Ocorreu um problema ao apagar a pasta “%@”.";
"DIR:ERROR SYNCING%"   = "Ocorreu um problema ao sincronizar a pasta “%@”.";
"DIR:ERROR MOVING%"    = "Ocorreu um problema ao mover a pasta “%@”.";
"DIR:ERROR ACCESSING%" = "Ocorreu um problema ao sincronizar a pasta “%@”.";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "O iDisk está quase cheio. Não existe espaço disponível suficiente no iDisk para sincronizar este item.";
"MHD DSKFULERR"        = "O seu directório pessoal está quase cheio. Não existe espaço disponível suficiente para sincronizar este item.";
"FS DSKFULERR"         = "O disco está quase cheio. Não existe espaço disponível suficiente para sincronizar este item.";
"IDISK DSKFULERR HELP" = "Há itens no iDisk que estão no Lixo. Para disponibilizar mais espaço, esvazie o Lixo.";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "Não tem permissão para apagar este ficheiro.";
"AFPACCESSDENIED SYNC"       = "Não tem permissão para sincronizar este ficheiro.";
"DIR:AFPACCESSDENIED DELETE" = "Não tem permissão para apagar esta pasta.";
"DIR:AFPACCESSDENIED SYNC"   = "Não tem permissão para sincronizar esta pasta.";
"AFPACCESSDENIED HELP"       = "Pode consultar as suas permissões no painel Informações do Finder.";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "O nome deste ficheiro é igual ao de outro item existente no seu espaço iDisk; apenas difere na utilização de maiúsculas e minúsculas.";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "O nome deste ficheiro é igual ao de outro item existente na sua pasta pessoal; apenas difere na utilização de maiúsculas e minúsculas.";
"FS KSFFILENAMEDIFFERSBYCASE"        = "O nome deste ficheiro é igual ao de outro item existente no disco; apenas difere na utilização de maiúsculas e minúsculas.";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "O nome desta pasta é igual ao de outro item existente no seu espaço iDisk; apenas difere na utilização de maiúsculas e minúsculas.";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "O nome desta pasta é igual ao de outro item existente na sua pasta pessoal; apenas difere na utilização de maiúsculas e minúsculas.";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "O nome desta pasta é igual ao de outro item existente no disco; apenas difere na utilização de maiúsculas e minúsculas.";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "Deve alterar o nome deste item para que fique menos parecido. Por exemplo, pode adicionar-lhe um número.";

// fBsyErr
"FSBSYERR"      = "O ficheiro está em utilização.";
"FSBSYERR HELP" = "Este ficheiro pode encontrar-se aberto por uma aplicação. Tente fechar o ficheiro ou fechar as aplicações abertas.";

// fLckdErr
"FLCKDERR"      = "Ficheiro protegido.";
"DIR:FLCKDERR"  = "Pasta protegida.";
"FLCKDERR HELP" = "Pode desbloquear o item através do painel Informações do Finder.";

"File Not Found"      = "O ficheiro não foi encontrado.";
"HELP:File Not Found" = "O ficheiro pode ter sido movido durante a sincronização. Tente repetir a sincronização.";

"File Name Too Long"      = "Existe um nome de ficheiro ou pasta demasiado grande.";
"HELP:File Name Too Long" = "Substitua o nome deste item por outro mais pequeno.";

"I/O Error"      = "Ocorreu um erro ao ler ou escrever o ficheiro.";
"HELP:I/O Error" = "Tente de novo mais tarde.";

"Destination does not support symlinks"      = "O destino não suporta symlinks.";
"HELP:Destination does not support symlinks" = "Tente comprimir primeiro o ficheiro ou a pasta.";

"Object deleted"      = "O item foi apagado antes de ter sido sincronizado.";
//"HELP:Object deleted" = "";

"Object created"      = "Um novo item foi criado na mesma localização deste item, antes de o item ter sido sincronizado.";
//"HELP:Object created" = "";

"Object modified"     = "Este item a ser actualizado foi modificado por outra aplicação antes de ter sido sincronizado.";
//"HELP:Object modified" = "";

"Network error"       = "Ocorreu um erro na rede.";
"HELP:Network error"  = "Verifique a sua ligação à rede ou tente de novo mais tarde.";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "Ocorreu um problema.";					// [rdar://5231555]
"HELP:Unknown error"       = "Tente de novo mais tarde.";
"HELP-IDISK:Unknown error" = "Tente de novo mais tarde.";
"HELP-PHD:Unknown error"   = "Volte a tentar mais tarde. Se o problema persistir, contacte o seu administrador de rede.";

"IDISK ALMOST FULL"     = "O iDisk está quase cheio.";
"ALMOST FULL TRASH MSG" = "Existem ficheiros no iDisk que estão no Lixo. Para libertar espaço, esvazie o Lixo.\n\nÉ possível aumentar o tamanho do iDisk no painel %@ das Preferências do Sistema.";
"ALMOST FULL .MAC MSG"  = "É possível aumentar o tamanho do iDisk no painel %@ das Preferências do Sistema.";

"REVERIFICATION"      = "O ficheiro foi alterado durante cada uma das últimas %@ sincronizações.";
"REVERIFICATION HELP" = "O ficheiro pode estar a ser alterado por uma aplicação. Tente fechar o ficheiro ou encerrar as aplicações abertas.";

"TOO_MANY_EAS"      = "O destino não suporta alguns dos dados contidos neste item.";
"TOO_MANY_EAS HELP" = "Tente comprimir primeiro o ficheiro ou a pasta.";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "A pasta %@ só está disponível quando o iDisk está online.";
"OFFLINE FOLDER MSG" = "Para aceder a esta pasta, é necessário ligar o computador à Internet.";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu bytes";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 conflito";
"%CONFLICTS" = "%d conflitos";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "\"%@\" foi modificado em ambos os locais.";			// Name of conflicting item.
"%WHERE"                   = "Em: %@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d de %d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-raiz-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "ficheiro";
"FOLDER"                   = "pasta";
"PACKAGE"                  = "pacote";
"SYMLINK"                  = "symlink";
"IDISK_LOCAL_TITLE"        = "Este computador";
"IDISK_POPUP_LOCAL_TITLE"  = "Manter o ficheiro neste computador";
"IDISK_POPUP_REMOTE_TITLE" = "Manter ficheiro em %@";
"MHD_LOCAL_TITLE"          = "Neste computador";
"MHD_REMOTE_TITLE"         = "Na rede";
"MHD_POPUP_LOCAL_TITLE"    = "Manter o ficheiro neste computador";
"MHD_POPUP_REMOTE_TITLE"   = "Manter o ficheiro na rede";
"1_IDISK_CONFLICT"         = "Há um conflito de sincronização do iDisk.";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "Há %d conflitos de sincronização do iDisk.";			// Plural for iDisk
"1_MHD_CONFLICT"           = "Existe um conflito de sincronização da pasta pessoal.";				// Singular for MHD
"%_MHD_CONFLICTS"          = "Existem %d conflitos de sincronização da pasta pessoal.";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "Resolver todos os conflitos utilizando os ficheiros em %@";
"IDISK_RESOLVE_LOCAL"      = "Resolver todos os conflitos utilizando os ficheiros neste computador";
"IDISK_RESOLVE_BOTH"       = "Resolver todos os conflitos mantendo ambos os ficheiros";
"IDISK_RESOLVE_LASTMOD"    = "Resolver todos os conflitos mantendo o ficheiro que tiver a data de modificação mais recente.";
"IDISK_RESOLVE_EXCLUDE"    = "Resolver todos os conflitos excluindo os ficheiros de futuras sincronizações.";
"IDISK_RESOLVE_NONE"       = "Ignorar todos os conflitos.";
"MHD_RESOLVE_REMOTE"       = "Resolver todos os conflitos utilizando os ficheiros na rede";
"MHD_RESOLVE_LOCAL"        = "Resolver todos os conflitos utilizando os ficheiros neste computador";
"MHD_RESOLVE_BOTH"         = "Resolver todos os conflitos mantendo ambos os ficheiros";
"MHD_RESOLVE_LASTMOD"      = "Resolver todos os conflitos mantendo o ficheiro que tiver a data de modificação mais recente.";
"MHD_RESOLVE_EXCLUDE"      = "Resolver todos os conflitos excluindo os ficheiros de futuras sincronizações.";
"MHD_RESOLVE_NONE"         = "Ignorar todos os conflitos.";
"MHD_CONFLICT_TITLE"       = "Conflitos de sincronização";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "Não foi possível resolver todos os conflitos";
"NOT_ALL_RESOLVED_MSG"   = "Não foi possível resolver alguns conflitos porque as datas de modificação são muito próximas. Resolva esses conflitos manualmente ou utilizando uma opção diferente.";

"There are no file syncing errors or conflicts." = "Não existem erros ou conflitos de sincronização do ficheiro.";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "A sincronização do iDisk não terminou. Volte a tentar mais tarde.";
"GLOBAL-HELP-IDISK:Timeout" = "Se continuar a ter problemas de sincronização com o iDisk, a ligação à Internet poderá ter problemas. Experimente encerrar outras aplicações que utilizem a Internet antes de voltar a tentar.";

"GLOBAL-IDISK:NetworkError"      = "A sincronização do iDisk não terminou.";
"GLOBAL-HELP-IDISK:NetworkError" = "Verifique a sua ligação à rede ou tente de novo mais tarde.";

"GLOBAL-IDISK:RemoteBusy"      = "A sincronização do iDisk não terminou.";
"GLOBAL-HELP-IDISK:RemoteBusy" = "Tente de novo mais tarde.";

"GLOBAL-IDISK:UNKNOWN"      = "A sincronização do iDisk não terminou, porque ocorreu um problema.";
"GLOBAL-HELP-IDISK:UNKNOWN" = "Tente de novo mais tarde.";

// PHD
"GLOBAL-PHD:Timeout"      = "A sincronização do directório de início não terminou. Volte a tentar mais tarde.";
"GLOBAL-HELP-PHD:Timeout" = "Se continuar a ter problemas de sincronização com directório de início, a ligação de rede poderá ter problemas. Experimente encerrar outras aplicações que utilizem a rede antes de voltar a tentar.";

"GLOBAL-PHD:NetworkError"      = "A sincronização do directório de início não terminou.";
"GLOBAL-HELP-PHD:NetworkError" = "Verifique a sua ligação à rede ou tente de novo mais tarde.";

"GLOBAL-PHD:RemoteBusy"      = "A sincronização do directório de início não terminou.";
"GLOBAL-HELP-PHD:RemoteBusy" = "Tente de novo mais tarde.";

"GLOBAL-PHD:UNKNOWN"      = "A sincronização do directório de início não terminou, porque ocorreu um problema.";
"GLOBAL-HELP-PHD:UNKNOWN" = "Tente de novo mais tarde.";

// Other
"GLOBAL-FS:Timeout"      = "A sincronização dos ficheiros não terminou. Volte a tentar mais tarde.";
"GLOBAL-HELP-FS:Timeout" = "Se continuar a ter problemas de sincronização com os ficheiros, a ligação de rede poderá ter problemas. Experimente encerrar outras aplicações que utilizem a rede antes de voltar a tentar.";

"GLOBAL-FS:NetworkError"      = "A sincronização dos ficheiros não terminou.";
"GLOBAL-HELP-FS:NetworkError" = "Verifique a sua ligação à rede ou tente de novo mais tarde.";

"GLOBAL-FS:RemoteBusy"      = "A sincronização dos ficheiros não terminou.";
"GLOBAL-HELP-FS:RemoteBusy" = "Tente de novo mais tarde.";

"GLOBAL-FS:UNKNOWN"      = "A sincronização dos ficheiros não terminou, porque ocorreu um problema.";
"GLOBAL-HELP-FS:UNKNOWN" = "Tente de novo mais tarde.";
